package lesson3;

public class Main {

    public static void main(String[] args) {

        /**
         * как создать массив. Пустой или полный и от этого будем создавать.
         * 1. Создать массив чисел и вывести все занчения на консоль.
         * Определили числа в каком типе, пример в инте.
         *
         */


        int[] numbers = {4, 8, 3, 5, 8, 5, 3};
//        System.out.println(numbers[0]);
//        System.out.println(numbers[1]);
//        System.out.println(numbers[2]);
//        System.out.println(numbers[3]);
//        System.out.println(numbers[4]);
//        System.out.println(numbers[5]);
//        System.out.println(numbers[6]);

        for (int i = 0; i < 7; i++) {
            System.out.println(numbers [i]);
        }
    }


}
