//package lesson4;
//
//public class Main {
//    public static void main(String[] args) throws InterruptedException {
//        /**
//         * Тема. Цикл в цикле.
//         * Написать программу, которая будет работать 10 лет, если ее не остановить.
//         * Как только остановм, напишет сколько прошло от старта.
//         * если брать 10 лет. 1,2,3, и 4 год одинаковый. Первый цикл от 0 до 10
//         * В году нужно подсчитать 12 месяцев/ Подразумеваем, что месяц 30 дней
//         *
//         */
//
//        for (int year = 0; year < 10; year++){
//          for (int month =0; month <12; month++){
//            for (int day =0; day <30; day ++){
//               for (int hour =0; hour < 24; hour++){
//                  for (int min = 0; min <60; min++ ){
//                      for (int sec =0; sec <60; sec++){
//                        System.out.printf("Ot starta proshlo: %d god, %d mes, %d dnia, %d chasov, %d min, %d sec \n", year, month, day, hour, min, sec"")
//                       Thread.sleep(1000);
//                    }
//
//                }
//
//            }
//
//        }
//
//
//    }
//
//
//        }
//
//
//
//
//    }
//}
